// pract4.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

#include <math.h>
#include <stdio.h>
#define _USE_MATH_DEFINES // for C++
#include <cmath>
using namespace std;

#define e 2.71828182845904523536
#define z 1
#define t 2
#define y tan(t) + z
#define x (8 * pow(z, 2)) / (y* pow(e, t) + pow(t, 2))



#define y2 0.65
#define x2 0.84
#define z2 pow(cos(y2), 2) + pow(sin(pow(x2, 3)), 3)
#define f (pow(e, (z2-1))) / (2*y2+pow(x2, 3)) + sin(pow(y2, 2))


int main()
{
    setlocale(LC_ALL, "Russian");
    cout << x << endl;
    cout << f << endl;
    cout << "Введите a\n";
    double a;
    cin >> a;
    double y3 = pow(cos(3 / 8 * 3.14 - a / 4), 2) - pow(cos(11 / 8 * 3.14 + a / 4), 2);
    cout << y3;




}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
